{
  "name": "Ethan Wiegert",
  "title": "Software Developer",
  "location": "Covington, GA 30014",
  "phone": "864-280-2564",
  "email": "ewiegert99@gmail.com",
  "profiles": ["LinkedIn", "GitHub"],
  "summary": "Proficient full-stack software engineer specializing in C#, SQL, and JavaScript. Demonstrated expertise in React, HTML, CSS, API implementation, .NET, Blazor, and frameworks such as Bootstrap. Experience in fast paced environments and driven to deliver high quality results.",
  "technical_skills": {
    "frontend": ["HTML", "CSS", "JavaScript", "React", "Blazor"],
    "backend": [".NET", "Node.js", "Express", "RESTful APIs", "PostgreSQL"],
    "tools": ["Mocha", "Chai", "Knex", "Git", "GitHub", "Heroku", "Node Package Manager", "Visual Studio Code"]
  },
  "professional_experience": [
    {
      "company": "Lexicon Tech Solutions",
      "location": "Conyers, GA",
      "position": "Software Developer",
      "duration": "04/2024 – Present",
      "responsibilities": [
        "Drive implementation of GitHub for version control, train team members on usage.",
        "Lead and initiate projects from design to implementation, collaborating with leadership team and relevant personnel",
        "Develop Software to facilitate new insurance programs and systems integrations",
        "Drive incremental improvements to streamline processes",
        "Assist in developing and implementing algorithms to aid in reducing turn time",
        "Develop full-stack applications to meet business needs using Blazor, .NET, and SQL"
      ]
    },
    {
      "company": "Thinkful",
      "location": "Remote",
      "position": "Software Engineering Student",
      "duration": "06/2023 – 12/2023",
      "responsibilities": [
        "Develop mobile-first approach applications in React",
        "Integrate full-stack applications with JavaScript using Node.js and Express, implementing RESTful APIs",
        "Implement databases to support applications using PostgreSQL",
        "Design front-end applications using HTML and CSS"
      ]
    },
    {
      "company": "Exela Pharma Sciences",
      "location": "Lenoir, NC",
      "position": "Microbiologist I",
      "duration": "08/2021 – 08/2022",
      "responsibilities": [
        "Analyzed 200+ viable microbial samples associated with batches of medicine and production environment.",
        "Guided the department on improving workflow of organism samples to deliver results on time if not early.",
        "Analyzed 30+ out-of-trend or out-of-study results for the department and wrote respective occurrence documents.",
        "Aided team on all forms of testing from raw material to finished product and ensuring all tests were performed with passing results."
      ]
    }
  ],
  "education": [
    {
      "institution": "Thinkful",
      "location": "Remote",
      "degree": "Certificate, Engineering",
      "graduation_date": "12/2023",
      "description": [
        "Acquired comprehensive knowledge of industry best practices and software development standards, focusing on JavaScript, HTML5, CSS3, React Native, Node.js, PostgreSQL, RESTful APIs, algorithms, and data structures.",
        "Demonstrated growth by successfully developing and launching mobile-first applications, actively engaging with senior web developers in mentor-student relationship to expand language proficiency and framework expertise."
      ]
    },
    {
      "institution": "Clemson University",
      "location": "Clemson, SC",
      "degree": "B.S., Microbiology",
      "graduation_date": "04/2021"
    }
  ]
}